src/Documents/КорректировкаНагрузки/КорректировкаНагрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаНагрузки</name>
  <registerRecords>AccumulationRegister.НагрузкаПреподавателей</registerRecords>
  <tabularSections>
    <name>Корректировка</name>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Месяц</name>
      <type>
        <types>EnumRef.МесяцыГода</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/НагрузкаПреподавателей/НагрузкаПреподавателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НагрузкаПреподавателей</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>EnumRef.МесяцыГода</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/КорректировкаНагрузки/ObjectModule.bsl
#Область ОбработкаПроведения

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.НагрузкаПреподавателей");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Корректировка;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Преподаватель", "Преподаватель");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Месяц", "Месяц");
	Блокировка.Заблокировать();
	
	Движения.НагрузкаПреподавателей.Записывать = Истина;
	
	Для Каждого СтрокаКорректировки Из Корректировка Цикл
		
		Если СтрокаКорректировки.КоличествоЧасов = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаКорректировки.Преподаватель) Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Не заполнен преподаватель в строке " + СтрокаКорректировки.НомерСтроки;
			СообщениеПользователю.Поле = "Корректировка[" + СтрокаКорректировки.НомерСтроки + "].Преподаватель";
			СообщениеПользователю.УстановитьДанные(ЭтотОбъект);
			СообщениеПользователю.Сообщить();
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаКорректировки.Месяц) Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Не заполнен месяц в строке " + СтрокаКорректировки.НомерСтроки;
			СообщениеПользователю.Поле = "Корректировка[" + СтрокаКорректировки.НомерСтроки + "].Месяц";
			СообщениеПользователю.УстановитьДанные(ЭтотОбъект);
			СообщениеПользователю.Сообщить();
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.НагрузкаПреподавателей.Добавить();	
		Движение.Период = Дата;
		Движение.Преподаватель = СтрокаКорректировки.Преподаватель;
		Движение.Месяц = СтрокаКорректировки.Месяц;
		Движение.Часы = Цел(СтрокаКорректировки.КоличествоЧасов);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
